public/orgnote.html

    <!DOCTYPE HTML>
    <html>
    <head>
    <meta charset="utf-8">

    <title>OrgNote说明</title>
    <meta name="author" content="My Name">
    <meta name="description" content="My information">
    <meta property="og:site_name" content="My Blog"/>
    <meta name="Keywords" content="My Blog keywords">

    <meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1">
    <meta property="og:image" content="undefined"/>
    <link href="/favicon.ico" rel="icon">

    
    <link rel="stylesheet" href="/css/bootstrap.min.css" media="screen" type="text/css">
    <link rel="stylesheet" href="/css/font-awesome.css" media="screen" type="text/css">
    <link rel="stylesheet" href="/css/style.css" media="screen" type="text/css">
    <link rel="stylesheet" href="/css/highlight.css" media="screen" type="text/css">
    </head>
    

    <body>  
    <nav id="main-nav" class="navbar navbar-inverse navbar-fixed-top" role="navigation">

    <div class="container">

    <button type="button" class="navbar-header navbar-toggle" data-toggle="collapse" data-target=".navbar-collapse">
    <span class="sr-only">Toggle navigation</span>
    <span class="icon-bar"></span>
    <span class="icon-bar"></span>
    <span class="icon-bar"></span>
    </button>

    <a class="navbar-brand" href="/index.html">My Blog</a>
    

    <div class="collapse navbar-collapse nav-menu">

    <ul class="nav navbar-nav">
    <li><a href="/public/minyi.html" title="归档"><i class="fa fa-sitemap"></i>MinYi</a></li><li><a href="/public/archive.html" title="归档"><i class="fa fa-archive"></i>归档</a></li><li><a href="/public/about.html" title="关于"><i class="fa fa-user"></i>关于</a></li>
    </ul>

    </div> <!-- navbar -->
    </div> <!-- container -->
    </nav>
    

    <div class="clearfix"></div>
    <div class="container">
    <div class="content">

    <div class="page-header">
    <h1>My Blot Title</h1>
    </div>

    <div class="row page">
    <div class="col-md-9">
    <div class="mypage">

    <div class="slogan">
    <i class="fa fa-heart"></i>
    标签: <a href="/public/tags/札记.html"><i class="札记"></i>札记</a>
    </div>  
    
<div id="content">
<h1 class="title">OrgNote: 一个简单的org-mode博客</h1>





<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 前言</a></li>
<li><a href="#sec-2">2 OrgNote</a></li>
<li><a href="#sec-3">3 配置自己的博客</a>
<ul>
<li><a href="#sec-3-1">3.1 基本设置</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 __dirs__</a></li>
<li><a href="#sec-3-1-2">3.1.2 __title__</a></li>
<li><a href="#sec-3-1-3">3.1.3 __author__</a></li>
<li><a href="#sec-3-1-4">3.1.4 __description__</a></li>
<li><a href="#sec-3-1-5">3.1.5 __blog_keywords__</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 功能定制</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1 博文清单</a></li>
<li><a href="#sec-3-2-2">3.2.2 博客(<code>关于</code>)页面定制</a></li>
<li><a href="#sec-3-2-3">3.2.3 添加多说评论功能</a></li>
<li><a href="#sec-3-2-4">3.2.4 添加微博展示功能</a></li>
<li><a href="#sec-3-2-5">3.2.5 添加友情链接</a></li>
<li><a href="#sec-3-2-6">3.2.6 修改最近文章数量</a></li>
</ul></li>
</ul>
</li>
<li><a href="#sec-4">4 后记</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">


<p>
自从使用 <code>Emacs</code> 编辑器的 <code>org-mode</code> 编辑文档后，我就喜欢上了写文档，也慢慢的积累了一些文件。
</p>
<p>
当我想把这些文档以博客的形式展示的时候，发现大多博客框架对于我来说都过于复杂了。即使是 <code>Hexo</code> ，我也不太习惯，我便想能否写一个用 <code>org-mode</code> 写博客的程序。
</p>
<p>
没有想太多功能，仅仅为了自己能用就行，随便弄了一个博客起来，拿了一个 <code>freemind</code> 的主题来用。
</p>
<p>
我表弟想在github上建立博客，我给他推荐 <code>hexo</code>, 理由是:
</p><blockquote>

<ul>
<li>流行
</li>
<li>容易上手
</li>
<li>专业
</li>
</ul>



</blockquote>


<p>
但没想到，他在自己机器上安装的时候遇到了各种各样的问题，最后不了了之。
</p>
<p>
这个事情让我觉得，或许有人会使用我这个程序，因为它 <code>足够简单</code> 。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> OrgNote</h2>
<div class="outline-text-2" id="text-2">


<p>
<code>OrgNote</code> 采用 <code>org-mode</code> 写博客，就如 <code>hexo</code> 使用 <code>markdown</code> 写博客一样，最终结果都是转换为 <code>Html</code>.
</p>
<p>
<code>OrgNote</code> 的使用很简单，主要步骤:
</p><blockquote>

<ol>
<li>获取程序: <code>git clone git@github.com:LeslieZhu/OrgNote.git</code>
</li>
<li>更新 <code>orgnote.py</code>, 根据自己情况修改，参考下一节
</li>
<li>写一篇 <code>.org</code> 文章，用 <code>org-expand-as-html</code> 生成html
</li>
<li>将新的html博文添加到 <code>public/index.org</code>
</li>
<li>运行: <code>python orgnote.py</code>
</li>
<li>查看效果: <code>python orgnote.py server [port]</code>, 浏览器打开 <code>localhost:port</code>
</li>
<li>同步到github: <code>git push origin master</code>
</li>
</ol>



</blockquote>


<ul>
<li><code>Emacs</code> 参考: <a href="http://www.gnu.org/software/emacs/">http://www.gnu.org/software/emacs/</a>
</li>
<li><code>Org-mode</code> 参考: <a href="http://orgmode.org/">org-mode</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 配置自己的博客</h2>
<div class="outline-text-2" id="text-3">


<p>
整个程序只有一个文件 <code>orgnote.py</code>, 因此以下所有的修改都在此文件中。
</p>

</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> 基本设置</h3>
<div class="outline-text-3" id="text-3-1">


</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> __dirs__</h4>
<div class="outline-text-4" id="text-3-1-1">


<p>
这个 <b>配置项</b> 是一个列表，列表的元素是一个个的文件，每个文件记录用于发布的文章清单。
</p>
</div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> __title__</h4>
<div class="outline-text-4" id="text-3-1-2">


<p>
博客的标题。
</p>
</div>

</div>

<div id="outline-container-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> __author__</h4>
<div class="outline-text-4" id="text-3-1-3">


<p>
作者。
</p>
</div>

</div>

<div id="outline-container-3-1-4" class="outline-4">
<h4 id="sec-3-1-4"><span class="section-number-4">3.1.4</span> __description__</h4>
<div class="outline-text-4" id="text-3-1-4">


<p>
对博客的描述。
</p>
</div>

</div>

<div id="outline-container-3-1-5" class="outline-4">
<h4 id="sec-3-1-5"><span class="section-number-4">3.1.5</span> __blog_keywords__</h4>
<div class="outline-text-4" id="text-3-1-5">


<p>
博客关键字，一些搜索引擎可能会收录。
</p>
</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> 功能定制</h3>
<div class="outline-text-3" id="text-3-2">


</div>

<div id="outline-container-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> 博文清单</h4>
<div class="outline-text-4" id="text-3-2-1">


<p>
博文清单书写方式举例:
</p><blockquote>




<pre class="example">: - [[../notes/orgnote.html][OrgNote说明: 公开版本]]
: + [[../notes/orgnote.html][OrgNote说明: 不公开版本]]
</pre>


</blockquote>


<p>
注意开头的 <code>-/+</code> 后面是有空格的，这是 <code>org-mode</code> 的标记方式。
</p><ul>
<li>如果是 <code>-</code>, 则博客发布到首页
</li>
<li>如果是 <code>+</code>, 则博客发布到 <code>/public/nopublic.html</code> 
</li>
</ul>


</div>

</div>

<div id="outline-container-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> 博客(<code>关于</code>)页面定制</h4>
<div class="outline-text-4" id="text-3-2-2">


<p>
找到函数 <code>contain_about</code> , 用下列HTML的标记方式写说明信息:
</p><blockquote>




<pre class="example">&lt;p&gt; 内容 &lt;/p&gt;
</pre>


</blockquote>


</div>

</div>

<div id="outline-container-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> 添加多说评论功能</h4>
<div class="outline-text-4" id="text-3-2-3">


<p>
找到函数 <code>duosuo</code>, 将 <code>多说评论</code> 的嵌入代码作为内容返回即可:
</p><blockquote>




<pre class="src src-python"><span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #0000ff; font-weight: bold;">duosuo</span>():
    <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">"""</span>
<span style="color: #00ff00;">    &#36825;&#37324;&#26159;&#25105;&#30340;&#22810;&#35828;&#24341;&#29992;&#20195;&#30721;:)</span>
<span style="color: #00ff00;">    """</span>
</pre>


</blockquote>


</div>

</div>

<div id="outline-container-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> 添加微博展示功能</h4>
<div class="outline-text-4" id="text-3-2-4">


<p>
找到函数 <code>sidebar_weibo</code>, 将自己微博代码加入，如:
</p><blockquote>




<pre class="src src-python"><span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #0000ff; font-weight: bold;">sidebar_weibo</span>():
     <span style="color: #00ffff; font-weight: bold;">return</span> <span style="color: #00ff00;">"""</span>
<span style="color: #00ff00;">     &#20320;&#30340;&#24494;&#21338;&#24341;&#29992;&#20195;&#30721;:)</span>
<span style="color: #00ff00;">     """</span>
</pre>


</blockquote>


</div>

</div>

<div id="outline-container-3-2-5" class="outline-4">
<h4 id="sec-3-2-5"><span class="section-number-4">3.2.5</span> 添加友情链接</h4>
<div class="outline-text-4" id="text-3-2-5">


<p>
找到函数 <code>sidebar_link</code>, 参考着写就行。
</p>
</div>

</div>

<div id="outline-container-3-2-6" class="outline-4">
<h4 id="sec-3-2-6"><span class="section-number-4">3.2.6</span> 修改最近文章数量</h4>
<div class="outline-text-4" id="text-3-2-6">


<p>
找到函数 <code>sidebar_latest</code>, 如要展示最近10篇文章，则改成:
</p><blockquote>




<pre class="src src-python"><span style="color: #00ffff; font-weight: bold;">def</span> <span style="color: #0000ff; font-weight: bold;">sidebar_latest</span>(notes=<span style="color: #0000ff; font-weight: bold;">list</span>(), num=10):
</pre>


</blockquote>


<p>
这个 <code>num=10</code> 表示默认是展示最近10篇文章。
</p>

</div>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 后记</h2>
<div class="outline-text-2" id="text-4">


<p>
<code>OrgNote</code> 是我的一个玩具，希望你也喜欢 :)
</p>




</div>
</div>
</div>

</div> <!-- col-md-12 --></div> <!-- row -->

    <div class="col-md-3">
    <div id="sidebar">
    

    <div class="widget">
    <h4>最新文章</h4>
    <ul class="entry list-unstyled">
    <li><a href="/public/orgnote.html"><i class="fa fa-file-o"></i>OrgNote说明
</a></li>
    </ul>   
    </div> 
    

    <div class="widget">
    <h4>标签云</h4>
    <ul class="tag_box inline list-unstyled">
    <li><a href="/public/tags/札记.html">札记<span>1</span></a></li>
    </ul>
    </div>
    

    

    <div class="widget">
    <h4>快速链接</h4>
    <ul class="entry list-unstyled">
    <li><a href="http://lesliezhu.github.com" title="LeslieZhu's Github" target="_blank"><i class="fa fa-github"></i>Leslie Zhu</a></li>
    </ul>
    </div>
    

    </div> <!-- sidebar -->
    </div> <!-- col-md-3 -->
    </div> <!-- row-fluid -->
    </div>
    </div>
    

    <div class="container-narrow">
      <footer>
        <p>&copy; 2014 My Name
        with help from <a href="https://github.com/LeslieZhu/OrgNote" target="_blank">OrgNote</a>, <a href="http://zespia.tw/hexo/" target="_blank">Hexo</a> and <a href="http://getbootstrap.com/" target="_blank">Twitter Bootstrap</a>. Theme by <a href="http://github.com/wzpan/hexo-theme-freemind/">Freemind.</a>  Published with GitHub Pages. 
      </p> </footer>
    </div> <!-- container-narrow -->
    
    <a id="gotop" href="#">   
      <span>▲</span> 
    </a>

    <link rel="stylesheet" href="./fancybox/jquery.fancybox.css" media="screen" type="text/css">

  </body>
</html>
    
